<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"local","plan_modifier":"051a6df03c1b94ddb53b9a5329a560edecfe2c5bcd6a6a36ac0b75d175265fcb","backend":"f0607400bdf2b63a000bb83f65c32d0435010e91304163f92c0a2590f5b42689","plan_job_ref":"Job Test actions using target, replace, and exclude #38 at https://github.com/dflook/terraform-github-actions/actions/runs/23685838897","plan_out_hash":"c05a4de9fbbe04e12d88e7db61cd0fe2cf013e963d8c4436d6091b4cc4c8daa7","plan_hash":"948d88afd51727cfc522df0007a37177b8b836a1924356239d8320113e7192ef","plan_text_format":"diff","version":"99.0.0","closed":true} -->
Terraform plan in __tests/workflows/test-target-replace-exclude__
Replacing resources: `random_string.foreach["hello"]`, `random_string.count[0]`
With variables: `length = 10`
<details>
<summary>Plan: 5 to add, 0 to change, 2 to destroy. Changes to Outputs.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # random_string.also_exclude will be created
+   resource "random_string" "also_exclude" {
+       id          = (known after apply)
+       length      = 10
+       lower       = true
+       min_lower   = 0
+       min_numeric = 0
+       min_special = 0
+       min_upper   = 0
+       number      = true
+       numeric     = true
+       result      = (known after apply)
+       special     = false
+       upper       = true
    }

  # random_string.count[0] will be replaced, as requested
-/+ resource "random_string" "count" {
!~      id          = "**********" -> (known after apply)
!~      result      = "**********" -> (known after apply)
#        (10 unchanged attributes hidden)
    }

  # random_string.exclude_me will be created
+   resource "random_string" "exclude_me" {
+       id          = (known after apply)
+       length      = 10
+       lower       = true
+       min_lower   = 0
+       min_numeric = 0
+       min_special = 0
+       min_upper   = 0
+       number      = true
+       numeric     = true
+       result      = (known after apply)
+       special     = false
+       upper       = true
    }

  # random_string.foreach["hello"] will be replaced, as requested
-/+ resource "random_string" "foreach" {
!~      id          = "**********" -> (known after apply)
!~      result      = "**********" -> (known after apply)
#        (10 unchanged attributes hidden)
    }

  # random_string.keep_me will be created
+   resource "random_string" "keep_me" {
+       id          = (known after apply)
+       length      = 10
+       lower       = true
+       min_lower   = 0
+       min_numeric = 0
+       min_special = 0
+       min_upper   = 0
+       number      = true
+       numeric     = true
+       result      = (known after apply)
+       special     = false
+       upper       = true
    }

Plan: 5 to add, 0 to change, 2 to destroy.

Changes to Outputs:
+   also_exclude = (known after apply)
!~  count        = "lgVkVEgn0l" -> (known after apply)
+   exclude_me   = (known after apply)
!~  foreach      = "WxJDhfq0fo" -> (known after apply)
+   keep_me      = (known after apply)
```
</details>

:white_check_mark: Plan applied in [Test actions using target, replace, and exclude #38](https://github.com/dflook/terraform-github-actions/actions/runs/23685838897)
<details open><summary>Outputs</summary>

```hcl
also_exclude = "6OFgSTkROr"
count        = "c5Gx50L10O"
exclude_me   = "0VczBM5Bv7"
foreach      = "10vvZZMwQp"
keep_me      = "smLfA7nWsw"
```
</details>